app/Controllers/BaseController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '8'
---
    public function cargarVista($view, $data)
    {

        $productosModel = new ProductosModel();
        if (session()->has('loggedUser')) {
            $usuarioId = session()->get('loggedUser');
            $usuariosModel = new UsuariosModel();
            $infoUsuario = $usuariosModel->find($usuarioId);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '8'
---
    public function cargarVistaAdmin($view, $data)
    {
        $usuariosModel = new UsuariosModel();
        $infoUsuario = $usuariosModel->find(session()->get('loggedUser'));