app/Controllers/CategoriasController.php

SELECT COUNT(*) AS `numrows`
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
AND `activo` = 1
 LIMIT 10
---
    public function listarCategorias()
    {
        $perPage = $this->request->getGet('perPage') ?? 10;
        $page = $this->request->getGet('page') ?? 1;
        $search = $this->request->getGet('search') ?? '';

        if (!empty($search)) {
            $this->categorias->like('nombre', $search);
        }

        $totalCategorias = $this->categorias->where('activo', 1)->countAllResults(false);
        $categorias = $this->categorias
            ->where('activo', 1)
            ->findAll($perPage, ($page - 1) * $perPage);