app/Controllers/Productos.php

SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
---
    public function listarProductos()
    {
        $perPage = $this->request->getGet('perPage') ?? 10;
        $page = $this->request->getGet('page') ?? 1;
        $search = $this->request->getGet('search') ?? '';
        $items = $this->productos->filtrarProductos($search, $perPage, $page);
        $totalProductos = $this->productos->where('activo', 1)->countAllResults(false);