app/Controllers/SaboresController.php

SELECT COUNT(*) AS `numrows`
FROM `sabores`
WHERE `activo` = 1
SELECT *
FROM `sabores`
WHERE `activo` = 1
AND `activo` = 1
 LIMIT 10
---
    public function listarSabores()
    {
        $perPage = $this->request->getGet('perPage') ?? 10;
        $page = $this->request->getGet('page') ?? 1;
        $search = $this->request->getGet('search') ?? '';

        if (!empty($search)) {
            $this->sabores->like('nombre', $search);
        }

        $totalSabores = $this->sabores->where('activo', 1)->countAllResults(false);
        $sabores = $this->sabores
            ->where('activo', 1)
            ->findAll($perPage, ($page - 1) * $perPage);