app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $usuarios = $this->usuarios->findAll();