app/Models/CategoriasModel.php

    public function obtenerCategoriasActivas()
    {
        return $this->where('activo', 1)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1

    public function actualizarCategoria($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `categorias` SET `activo` = 1, `fecha_edit` = '2025-03-10 21:20:41'
WHERE `categorias`.`id` IN ('9')

    public function obtenerCategoriasInactivas()
    {
        return $this->where('activo', 0)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 0