app/Models/ConsultasModel.php

SELECT *
FROM `consultas`
---
    public function obtenerTodasLasConsultas()
    {
        return $this->findAll();