app/Models/MarcasModel.php

SELECT *
FROM `marcas`
WHERE `activo` = 1
---
    public function obtenerMarcasActivas()
    {
        return $this->where('activo', 1)->findAll();