app/Models/PedidosModel.php

SELECT *
FROM `pedidos`
WHERE `id_usuario` = '8'
ORDER BY `fecha_compra` DESC
---
    public function obtenerPedidosPorUsuario($idUsuario)
    {
        return $this
            ->where('id_usuario', $idUsuario)
            ->orderBy('fecha_compra', 'DESC')
            ->findAll();