app/Models/PresentacionesModel.php

SELECT `presentaciones`.*, `sabores`.`nombre` AS `nombre_sabor`, `unidades`.`nombre_corto` AS `nombre_unidad`, GROUP_CONCAT(imagenes_presentaciones.nombre_imagen) as imagenes
FROM `presentaciones`
LEFT JOIN `imagenes_presentaciones` ON `presentaciones`.`id` = `imagenes_presentaciones`.`id_presentacion`
LEFT JOIN `sabores` ON `presentaciones`.`id_sabor` = `sabores`.`id`
LEFT JOIN `unidades` ON `presentaciones`.`id_unidad` = `unidades`.`id`
WHERE `presentaciones`.`id_producto` = '74'
GROUP BY `presentaciones`.`id`
---
    public function obtenerPresentaciones($idProducto)
    {
        return $this->select("presentaciones.*,
                      sabores.nombre AS nombre_sabor,
                      unidades.nombre_corto AS nombre_unidad,
                      GROUP_CONCAT(imagenes_presentaciones.nombre_imagen) as imagenes")
            ->where("presentaciones.id_producto", $idProducto)
            ->join("imagenes_presentaciones", "presentaciones.id = imagenes_presentaciones.id_presentacion", "left")
            ->join("sabores", "presentaciones.id_sabor = sabores.id", "left")
            ->join("unidades", "presentaciones.id_unidad = unidades.id", "left")
            ->groupBy("presentaciones.id")
            ->findAll();