app/Models/ProductosModel.php

SELECT `productos`.*, `categorias`.`nombre` AS `nombre_categoria`, `marcas`.`nombre` AS `nombre_marca`
FROM `productos`
LEFT JOIN `categorias` ON `productos`.`id_categoria` = `categorias`.`id`
LEFT JOIN `marcas` ON `productos`.`id_marca` = `marcas`.`id`
WHERE `productos`.`activo` = 1
 LIMIT 10
---
    public function filtrarProductos($busqueda, $porPagina, $pagina)
    {
        if (empty($busqueda)) {
            return $this->agregarJoins()->where('productos.activo = 1')->findAll($porPagina, ($pagina - 1) * $porPagina);

SELECT `productos`.*, `categorias`.`nombre` AS `nombre_categoria`, `marcas`.`nombre` AS `nombre_marca`
FROM `productos`
LEFT JOIN `categorias` ON `productos`.`id_categoria` = `categorias`.`id`
LEFT JOIN `marcas` ON `productos`.`id_marca` = `marcas`.`id`
WHERE `productos`.`activo` = 1
---
    public function obtenerProductosInactivos()
    {
        return $this
            ->agregarJoins()
            ->where('productos.activo = 0')
            ->findAll();

SELECT `productos`.*, `categorias`.`nombre` AS `nombre_categoria`, `marcas`.`nombre` AS `nombre_marca`
FROM `productos`
LEFT JOIN `categorias` ON `productos`.`id_categoria` = `categorias`.`id`
LEFT JOIN `marcas` ON `productos`.`id_marca` = `marcas`.`id`
WHERE `productos`.`id` = '74'
---
    public function obtenerProductoPorID($id)
    {
        return $this->select('productos.*,
          categorias.nombre AS nombre_categoria,
          marcas.nombre AS nombre_marca')
            ->join('categorias', 'productos.id_categoria = categorias.id', 'left')
            ->join('marcas', 'productos.id_marca = marcas.id', 'left')
            ->find($id);