app/Models/SaboresModel.php

SELECT *
FROM `sabores`
WHERE `activo` = 1
---
    public function obtenerSaboresActivos()
    {
        return $this->where('activo', 1)->findAll();

UPDATE `sabores` SET `activo` = 1, `fecha_edit` = '2025-03-10 21:21:01'
WHERE `sabores`.`id` IN ('2')
---
    public function actualizarSabor($id, $data)
    {
        return $this->update($id, $data);

SELECT *
FROM `sabores`
WHERE `activo` = 0
---
    public function obtenerSaboresInactivos()
    {
        return $this->where('activo', 0)->findAll();