app/Models/UnidadesModel.php

    public function obtenerUnidadesActivas()
    {
        return $this->where('activo', 1)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1