app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '8'
---
    public function obtenerUsuarioPorId($id)
    {
        return $this->find($id);